In [11]:
# Q1
def square_root_generator(limit):
    n = 1
    while n <= limit:
        yield n ** 0.5
        n += 1

# Example usage:
limit = 5
generator = square_root_generator(limit)

sum = 0
for sqrt_value in generator:
    print(sqrt_value)
    sum += sqrt_value

print(f'sum of the outputs of the generator for limit 5: {sum}')

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
sum of the outputs of the generator for limit 5: 8.382332347441762

In [12]:
# Q2
def square_root_generator(limit):
    n = 1
    while n <= limit:
        yield n ** 0.5
        n += 1

# Example usage:
limit = 13
generator = square_root_generator(limit)

for sqrt_value in generator:
    print(sqrt_value)

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
2.449489742783178
2.6457513110645907
2.8284271247461903
3.0
3.1622776601683795
3.3166247903554
3.4641016151377544
3.605551275463989

In [9]:
%%capture
!pip install dlt[duckdb]

In [10]:
# Q3
def people_1():
    for i in range(1, 6):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 25 + i, "City": "City_A"}

for person in people_1():
    print(person)

{'ID': 1, 'Name': 'Person_1', 'Age': 26, 'City': 'City_A'}
{'ID': 2, 'Name': 'Person_2', 'Age': 27, 'City': 'City_A'}
{'ID': 3, 'Name': 'Person_3', 'Age': 28, 'City': 'City_A'}
{'ID': 4, 'Name': 'Person_4', 'Age': 29, 'City': 'City_A'}
{'ID': 5, 'Name': 'Person_5', 'Age': 30, 'City': 'City_A'}

In [11]:
import dlt

generators_pipeline = dlt.pipeline(destination='duckdb', dataset_name='generators_h')

info = generators_pipeline.run(people_1(),
                               table_name="workshop_homework",
                               write_disposition="replace")

print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.59 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators_h
The duckdb destination used duckdb:////workspaces/KimZoomcamp2024/2_docker_sql/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708018472.3329062 is LOADED and contains no failed jobs

In [12]:
import duckdb

conn = duckdb.connect(f"{generators_pipeline.pipeline_name}.duckdb")

conn.sql(f"SET search_path = '{generators_pipeline.dataset_name}'")
print("\n\n\n workshop_homework table below:")

people_table = conn.sql("SELECT * FROM workshop_homework").df()
display(people_table)

 workshop_homework table below:

   id      name  age    city        _dlt_load_id         _dlt_id
0   1  Person_1   26  City_A  1708018472.3329062  vn4mTuYNRL01lA
1   2  Person_2   27  City_A  1708018472.3329062  rHZXy233uLp3Iw
2   3  Person_3   28  City_A  1708018472.3329062  WKwi5whwYo3PJA
3   4  Person_4   29  City_A  1708018472.3329062  +BgVBCMvpbsolA
4   5  Person_5   30  City_A  1708018472.3329062  lE3chXYRJdH46A

In [13]:
age_sum = conn.sql("SELECT SUM(age) FROM workshop_homework").df()
display(age_sum)

   sum(age)
0     140.0

In [14]:
def people_2():
    for i in range(3, 9):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 30 + i, "City": "City_B", "Occupation": f"Job_{i}"}


for person in people_2():
    print(person)

{'ID': 3, 'Name': 'Person_3', 'Age': 33, 'City': 'City_B', 'Occupation': 'Job_3'}
{'ID': 4, 'Name': 'Person_4', 'Age': 34, 'City': 'City_B', 'Occupation': 'Job_4'}
{'ID': 5, 'Name': 'Person_5', 'Age': 35, 'City': 'City_B', 'Occupation': 'Job_5'}
{'ID': 6, 'Name': 'Person_6', 'Age': 36, 'City': 'City_B', 'Occupation': 'Job_6'}
{'ID': 7, 'Name': 'Person_7', 'Age': 37, 'City': 'City_B', 'Occupation': 'Job_7'}
{'ID': 8, 'Name': 'Person_8', 'Age': 38, 'City': 'City_B', 'Occupation': 'Job_8'}

In [15]:
import dlt

generators_pipeline = dlt.pipeline(destination='duckdb', dataset_name='generators_h')

info = generators_pipeline.run(people_2(),
                               table_name="workshop_homework",
                               write_disposition="append")

print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.26 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators_h
The duckdb destination used duckdb:////workspaces/KimZoomcamp2024/2_docker_sql/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708018796.342256 is LOADED and contains no failed jobs

In [16]:
import duckdb

conn = duckdb.connect(f"{generators_pipeline.pipeline_name}.duckdb")

conn.sql(f"SET search_path = '{generators_pipeline.dataset_name}'")
print("\n\n\n workshop_homework table below:")

people_table = conn.sql("SELECT * FROM workshop_homework").df()
display(people_table)

 workshop_homework table below:

    id      name  age    city        _dlt_load_id         _dlt_id occupation
0    1  Person_1   26  City_A  1708018472.3329062  vn4mTuYNRL01lA       None
1    2  Person_2   27  City_A  1708018472.3329062  rHZXy233uLp3Iw       None
2    3  Person_3   28  City_A  1708018472.3329062  WKwi5whwYo3PJA       None
3    4  Person_4   29  City_A  1708018472.3329062  +BgVBCMvpbsolA       None
4    5  Person_5   30  City_A  1708018472.3329062  lE3chXYRJdH46A       None
5    3  Person_3   33  City_B   1708018796.342256  9einWkQ6iwvD1Q      Job_3
6    4  Person_4   34  City_B   1708018796.342256  wUlU5KmmuT1Xkw      Job_4
7    5  Person_5   35  City_B   1708018796.342256  n4sf7qjbPrKYdA      Job_5
8    6  Person_6   36  City_B   1708018796.342256  hhXep8TrkWs3Qg      Job_6
9    7  Person_7   37  City_B   1708018796.342256  2KYQa1WozWpN8Q      Job_7
10   8  Person_8   38  City_B   1708018796.342256  cncKFlkpp533CQ      Job_8

In [17]:
age_sum_new = conn.sql("SELECT SUM(age) FROM workshop_homework").df()
display(age_sum_new)

   sum(age)
0     353.0

In [18]:
# Q4
generators_pipeline_2 = dlt.pipeline(destination='duckdb', dataset_name='generators_h2')

info = generators_pipeline_2.run(people_1(),
                               table_name="workshop_homework_2",
                               write_disposition="replace",
                               primary_key='id')

print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.30 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators_h2
The duckdb destination used duckdb:////workspaces/KimZoomcamp2024/2_docker_sql/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708019351.4935472 is LOADED and contains no failed jobs

In [19]:
conn = duckdb.connect(f"{generators_pipeline_2.pipeline_name}.duckdb")

conn.sql(f"SET search_path = '{generators_pipeline_2.dataset_name}'")
print("\n\n\n workshop_homework_2 table below:")

people_table = conn.sql("SELECT * FROM workshop_homework_2").df()
display(people_table)

 workshop_homework_2 table below:

   id      name  age    city        _dlt_load_id         _dlt_id
0   1  Person_1   26  City_A  1708019351.4935472  WlV+l071X8BaxA
1   2  Person_2   27  City_A  1708019351.4935472  aRdNOCUP0xKAfw
2   3  Person_3   28  City_A  1708019351.4935472  ia15EmgFIn8sFQ
3   4  Person_4   29  City_A  1708019351.4935472  iL0yAiwjnrJXvw
4   5  Person_5   30  City_A  1708019351.4935472  xe7PpMZVkwGFKQ

In [20]:
generators_pipeline_2 = dlt.pipeline(destination='duckdb', dataset_name='generators_h2')

info = generators_pipeline_2.run(people_2(),
                               table_name="workshop_homework_2",
                               write_disposition="merge",
                               primary_key='id')

print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.51 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators_h2
The duckdb destination used duckdb:////workspaces/KimZoomcamp2024/2_docker_sql/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708019430.6280234 is LOADED and contains no failed jobs

In [21]:
conn = duckdb.connect(f"{generators_pipeline_2.pipeline_name}.duckdb")

conn.sql(f"SET search_path = '{generators_pipeline_2.dataset_name}'")
print("\n\n\n workshop_homework_2 table below:")

people_table = conn.sql("SELECT * FROM workshop_homework_2").df()
display(people_table)

 workshop_homework_2 table below:

   id      name  age    city        _dlt_load_id         _dlt_id occupation
0   1  Person_1   26  City_A  1708019351.4935472  WlV+l071X8BaxA       None
1   2  Person_2   27  City_A  1708019351.4935472  aRdNOCUP0xKAfw       None
2   8  Person_8   38  City_B  1708019430.6280234  IZppXZvH9f6lnw      Job_8
3   4  Person_4   34  City_B  1708019430.6280234  4XzOlMH29HPc1Q      Job_4
4   5  Person_5   35  City_B  1708019430.6280234  hleU8IyMF+FjMA      Job_5
5   7  Person_7   37  City_B  1708019430.6280234  avRZ+E0Rrap0wA      Job_7
6   3  Person_3   33  City_B  1708019430.6280234  /O22mjK12UbWDw      Job_3
7   6  Person_6   36  City_B  1708019430.6280234  A1E9eFywDjNbWw      Job_6

In [23]:
age_sum_2 = conn.sql("SELECT SUM(age) FROM workshop_homework_2").df()
display(age_sum_2)

   sum(age)
0     266.0